IDEA StatiCa Open Model
MatConcreteSIA.DiagramType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 type of stress-strain diagram bilinear/parabolic/general for ULS calculation
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ConcDiagramType DiagramType { get; set; }
Public Property DiagramType As ConcDiagramType
	Get
	Set
public:
property ConcDiagramType DiagramType {
	ConcDiagramType get ();
	void set (ConcDiagramType value);
}
Property Value
Type: ConcDiagramType
See Also
Reference
MatConcreteSIA Class
IdeaRS.OpenModel.Material Namespace